// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

Console.WriteLine("Введите пятизначное число ");
int num = Convert.ToInt32(Console.ReadLine());

void palindrome(int number)
{
    int counter = 0;
    while (counter < number/2)
    {
        if i[0] = i[Array.Lenght - 1]
    }
    counter++;
}